#1) შექმენით 5 ელემენტიანი სია.
#  for ციკლის მეშვეობით მომხმარებელს 
# შემოატანინეთ კიდევ 5 რიცხვი და თითოეული შემოტანილი რიცხვი
#  .append ფუნქციის მეშვეობით ჩაამატეთ არსებულ სიაში.
#  საბოლოოდ დაბეჭდეთ ეს სია

#2) იგივე სიაში მე-3 და მე-4 ელემენტებს შორის ჩასვით თქვენი სახელი.
#  მე-5 ინდექსზე ჩაამატეთ თქვენი ასაკი. სიის თავში ჩაამატეთ თქვენი სიმაღლე.
#  სიის ბოლოში კი თქვემი საყვარელი რიცხვი. საბოლოოდ დაბეჭდეთ ეს სია


list=[0,1,2,4,5]

list.append(6)
list.append(7)
list.append(8)
list.append(9)
list.append(10)

list.insert(3,"deme")
list.insert(0,"162cm")
list.insert(12,"25")
print(list)