#1) მომხმარებელს შემოატანინეთ წინადადება, დაითვალეთ მასში
#  space-ების რაოდენობა და დაბეჭდეთ.

#2) შექმენით 5 ელემენტიანი სიტყვების სია. მომხმარებელს შემოატანინეთ სიტყვა და
#რიცხვი(ეს იქნება პოზიცია სადაც დაამატებთ შემოტანილ სიტყვას). დაბეჭდეთ განახლებული სია.

#3) გაკვეთილზე შევქმენით პროგრამა, რომელიც წინადადებას გადაიყვანს camelCase-ში.
#  თქვენი დავალებაა დაწეროთ პროგრამა, რომელიც გააკეთებს პირიქით.

#Input: "helloWorld" -> Output: "Hello world"

#4) ასევე დაწერეთ პროგრამა, რომელიც შემოტანილ წინადადებას გადაიყვანს snake_case-ში.

#5) შექმენით ცარიელი სია. მომხმარებელს შემოატანინეთ 5 სახელი და ჩაამატეთ ისინი ამ სიაში.
#  გადაურეთ ამ სიას for ციკლით, შემდეგ კი სახელის თითოეულ ასოს(დაგჭირდება 2 for ციკლით,
#  ანუ for ციკლი მეორე for ციკლში). ასევე for ციკლების ზემოთ უნდა გქონდეთ შექმნილი კიდევ
#  ერთი ცარიელი სია, სადაც ჩაამატებთ ასოებიდან მხოლოდ თანხმოვნებს.

#გადაურეთ მიღებულ თანხმოვნების სიას და წაშალეთ დუბლიკატები, მოიძიეთ თუ როგორ შეიძლება
#  სიის დასორტირება, დაასროტრირეთ ის ანბანის მიხედვით და დაბეჭდეთ.


# first hw

h=input("put something here : ")
print(h.find(" "))

#secend hw

#where should i put new words?

#third

#?

#?

#?