#1) გადაიმეორეთ ყველაფერი რაც აქამდე ისწავლეთ ფუნქციებზე, მათ სახეობებზე მათ დანიშნულებებზე.

#gadavimeore ;)

#2) დაწერე ფუნქცია, რომელიც ბეჭდავს "Hello, world!"

def hello_world_printer():
    print("hello world")

hello_world_printer()

#3) დაწერე ფუნქცია, რომელიც იღებს სახელს და ბეჭდავს "Hello, [სახელი]!"

def hello_name_printer(name):
    print("hello " + name)

hello_name_printer("deme")

#4) დაწერე ფუნქცია, რომელიც იღებს ორ რიცხვს და აბრუნებს მათ ჯამს

def ba():
    inpu=int(input("number any here put : "))
    nput=int(input("number any here put : "))
    print( inpu + nput)

ba

#5) დაწერე ფუნქცია, რომელიც იღებს ერთ რიცხვს და აბრუნებს "Even" თუ ლუწია, ან "Odd" თუ კენტია

def a():
    inputing=int(input("number any here put : "))
    if inputing%2==0:
        print("even")
    else:
        print("odd")

a()

#6) დაწერე ფუნქცია, რომელიც იღებს სიის ელემენტებს და აბრუნებს მათ საშუალოს

#?

#7) დაწერე ფუნქცია, რომელიც იღებს სტრიქონს და აბრუნებს ამ სტრიქონის სიგრძეს

#?

#8) დაწერე ფუნქცია, რომელიც იღებს სიას და აბრუნებს მას შებრუნებულ მდგომარეობაში

#?

#9) დაწერე ფუნქცია, რომელიც იღებს სტრიქონს და აბრუნებს მას დიდ ასოებად გადაყვაvs.

def b():
    inputu=str(input("winadadeba any here put : "))
    print(inputu.upper)

b()

#10) დაწერე ფუნქცია, რომელიც იღებს ორ რიცხვს და აბრუნებს მათ შორის უმეტესს

def c():
    i=int(input("number any here put : "))
    inA=int(input("number any here put : "))
    if i>inA:
        print(i)
    else:
        print(inA)

#11) დაწერე ფუნქცია, რომელიც იღებს რიცხვს და აბრუნებს True თუ ის უარყოფითია, False თუ არა

#?

#12) დაწერე ფუნქცია, რომელიც იღებს სიტყვების სიას და აბრუნებს სიის ყველაზე გრძელ სიტყვას.
#  გამოიყენე ციკლი და 'len()' შედარებისთვის

# len ar vici me :(

#13) დაწერე ფუნქცია, რომელიც იღებს რიცხვს 'n' და აბრუნებს სიას 1-დან 'n'-ის ჩათვლით ყველა ლუწი რიცხვით.
#  გამოიყენე for ციკლი და if-else

#?

#14) დაწერე ფუნქცია, რომელიც იღებს სტრიქონს და აბრუნებს მასში ხმოვნების (a, e, i, o, u) რაოდენობას.
#  გამოიყენე ციკლი და if-else.

#?