#2) კომენტარებით ახსენით თუ რა არის custom ფუნქციები, რისთვის გამოვიყენებთ და
#  რა დანიშნულება გააჩნიათ,ასევე ახსენით მისი შექმნის გზები ეტაპობრივად და ახსენეთ თუ
#  რაა პარამეტრები და არგუმენტები.

#3) შექმენით ფუნქცია, რომელსაც გადაეცემა ორი რიცხვი.
#თქვენი დავალებაა დააბრუნოთ ამ ორი რიცხვის ჯამი.

#4) შექმენით ფუნქცია, რომელსაც გადაეცემა 1 რიცხვი.
#  თქვენი დავალებაა შეამოწმოთ ამ რიცხვის ლუწობა.
#  თუ იგი ლუწია, დაბეჭდეთ "რიცხვი ლუწია" სხვა შემთხვევაში "რიცხვი კენტია"

#5) შექმენით ფუნქცია, რომელსაც გადაეცემა 1 რიცხვი.
#  თქვენი დავალებაა დააბრუნოთ ამ რიცხვის კვადრატული მნიშნელობა.

#6) შექმენით ფუნქცია, რომელიც გადაცემულ ტექსტს აბრუნებს დიდი ასოებით.

#7) შექმენით ფუნქცია, რომელსაც პარამეტრებად გადაეცემა სახელი და გვარი,
#  თქვენი დავალებაა გამოიტანოთ მნიშვნელობები ერთი წინადადების სახით.

#costom it shegvilia chveni funqcia gavaketot magalitad print

def pius():
    in_put=int(input("put number here : "))
    in_puti=int(input("put number here : "))
    print(in_put+in_puti)

pius()

def even():
    inpat=int(input("put nub : "))
    if inpat%2==0:
        Print("numer is even")
    else:
        print("number is odd")

def ha():
    aaa=str(input(" ; "))
    print(aaa.upper)

#ver mivxvdi