#1) შექმენით ფუნქცია, რომელიც იღებს სამ რიცხვს და აბრუნებს ამ რიცხვებს შორის ყველაზე დიდს.

#2) შექმენით ფუნქცია, რომელიც მიიღებს სიტყვას და დააბრუნებს მისი ასოების რაოდენობას.

#3) შექმენით ფუნქცია, რომელიც მიიღებს რაღაც რიცხვს, ამის შემდეგ კი დააბრუნებს ამ რიცხვის
#  კვადრატულ მნიშვნელობას.

#4) შექმენით ფუნქცია, რომელიც მიიღებს 3 რიცხვს, თქვენი დავალებაა დააბრუნოთ ამ სამი რიცხვის ნამრავლი.

#5) შექმენით ფუნქცია, რომელიც იღებს ერთ რიცხვს და აბრუნებს "დადებითია" თუ რიცხვი დადებითია,
#  "უარყოფითია" თუ რიცხვი უარყოფითია და "ნულია" თუ შესაბამისად რიცხვი ნულის ტოლია.



def aaa():
    i_n=int(input("number : "))
    i_ni=int(input("number : "))
    i_na=int(input("number : "))
    if i_n<i_ni<i_na:
        print(i_na)
    elif i_ni<i_na<i_n:
        print(i_n)
    elif i_n<i_na<i_ni:
        print(i_ni)

    return()

aaa()


def iii():
    inp=str(input("words : "))
    